In [1]:
import pandas as pd
import numpy as np
pd.__version__

'1.0.5'

### 1. Create Pandas series

In [2]:
# creating numeric series
numeric = pd.Series([2, 4, 5, 6, 9]) # implicit indexing
print(numeric)
print(type(numeric))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
# creating series of characters
# notice dtype as object
char_series = pd.Series({'A':'a', 'B':'b', 'C':'af'})
char_series

A     a
B     b
C    af
dtype: object

In [4]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
print(date_series)
type(date_series)

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

pandas.core.indexes.datetimes.DatetimeIndex

In [5]:
# creating a series of type booleans
registrations = [True, False, False, False, True]

pd.Series(registrations)

0     True
1    False
2    False
3    False
4     True
dtype: bool

#### Explicit specification of indices

In [6]:
s = pd.Series(['Tiger', 'Bear', 'Mouse'], index=['India', 'America', 'Canada'])
print(s)
## explicit indexing using the index argument
s[['India','America']]

India      Tiger
America     Bear
Canada     Mouse
dtype: object

India      Tiger
America     Bear
dtype: object

In [7]:
# array
array = pd.Series(np.array(range(0,10))**2, index = range(0,10))
array

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [8]:
# dictionary 

sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

In [9]:
# list
fruits = ["Apple", "Orange", "Plum", "Grape", "Blueberry", "Watermelon"]
weekdays = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Monday"]

a = pd.Series(data = fruits, index = weekdays)
a

Monday            Apple
Tuesday          Orange
Wednesday          Plum
Thursday          Grape
Friday        Blueberry
Monday       Watermelon
dtype: object

In [10]:
convert = array.values
convert

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81], dtype=int32)

### 2. Properties in Series

In [11]:
print(char_series.shape)
print(char_series.ndim)
print(char_series.size)

(3,)
1
3

### 3. Accessing elements in series - loc and iloc

In [12]:
t= pd.Series([100,200,300,400])
t

0    100
1    200
2    300
3    400
dtype: int64

In [13]:
print(t.loc[0])
print(t.iloc[0])

100
100

In [15]:
t= pd.Series(['A','B','C','D'], index = np.random.permutation(t.shape[0]))
t

0    A
1    B
2    C
3    D
dtype: object

In [16]:
t.loc[1]

'B'

In [17]:
t.iloc[1]

'B'

In [18]:
t= pd.Series(['A','B','C','D'], index = ['a','b','c','d'])
t

a    A
b    B
c    C
d    D
dtype: object

In [19]:
t.loc['a']

'A'

In [20]:
t.iloc[1]

'B'

### 4. Deleting elements in Series

In [21]:
numeric

0    2
1    4
2    5
3    6
4    9
dtype: int64

In [22]:
numeric_drop = numeric.drop(labels = range(0,2))
numeric_drop

2    5
3    6
4    9
dtype: int64

In [23]:
numeric_drop = numeric.drop(numeric.index[2])
numeric_drop

0    2
1    4
3    6
4    9
dtype: int64

In [24]:
numeric_drop[numeric_drop.values != 6]

0    2
1    4
4    9
dtype: int64

#### Date

In [25]:
sr = pd.Series(data = [11, 11, 8, 18, 65, 18, 32, 10, 5, 32, 32], 
               index  = pd.date_range('2010-10-09', periods = 11, freq ='M'))
sr

2010-10-31    11
2010-11-30    11
2010-12-31     8
2011-01-31    18
2011-02-28    65
2011-03-31    18
2011-04-30    32
2011-05-31    10
2011-06-30     5
2011-07-31    32
2011-08-31    32
Freq: M, dtype: int64

In [26]:
# drop the passed labels 
result = sr.drop(labels = [pd.Timestamp('2010-12-31'), 
                           pd.Timestamp('2011-04-30'), pd.Timestamp('2011-08-31')]) 
  
# Print the result 
print(result)

2010-10-31    11
2010-11-30    11
2011-01-31    18
2011-02-28    65
2011-03-31    18
2011-05-31    10
2011-06-30     5
2011-07-31    32
dtype: int64

In [27]:
m = pd.Series([2,4,5], index=[2,2,1])
m

2    2
2    4
1    5
dtype: int64

In [28]:
mm= m.drop(labels = [1])
mm

2    2
2    4
dtype: int64

In [29]:
mm[mm.values != 4]

2    2
dtype: int64

### 5. Modifying Series

In [30]:
up = pd.Series(['a', 'b', 'c'])
up.update(pd.Series(['d', 'e'], index=[0, 2]))
up

0    d
1    b
2    e
dtype: object

In [31]:
s = pd.Series([1, 2, 3])
s.update(pd.Series([4, np.nan, 6]))
s

0    4
1    2
2    6
dtype: int64

In [32]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])
s1.append(s2, ignore_index = True)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [33]:
s = pd.Series([1, 2, 3])
s.update(pd.Series([4, 5, 6, 7, 8]))
s

0    4
1    5
2    6
dtype: int64

### 6. Arithmetic operations in Series

In [35]:
#import data
google = pd.read_csv("GOOGL_2006-01-01_to_2018-01-01.csv", usecols = ["High"], squeeze = True)
google.head

<bound method NDFrame.head of 0        218.05
1        224.70
2        226.00
3        235.49
4        236.94
         ...
3014    1071.72
3015    1068.86
3016    1068.27
3017    1064.84
3018    1058.05
Name: High, Length: 3019, dtype: float64>

In [36]:
google.count()

3019

In [37]:
google.sum()

1303711.73

In [38]:
google.mean()

431.8356177542223

In [39]:
google.sum() / google.count()

431.8356177542232

In [40]:
google.std()
#sum(sqrt((mean-data)^2)/count)

237.51408686940204

In [41]:
google.min()

134.82

In [42]:
google.max()

1086.49

In [43]:
google.median()

312.81

In [44]:
google.mode()

0    236.74
dtype: float64

In [45]:
google.describe()

count    3019.000000
mean      431.835618
std       237.514087
min       134.820000
25%       250.190000
50%       312.810000
75%       575.975000
max      1086.490000
Name: High, dtype: float64

In [46]:
# Returns row label of the maximum value
google.idxmax()

3010

In [47]:
#Returns the row label of the minimum value
google.idxmin()

728

In [48]:
google.diff()

0        NaN
1       6.65
2       1.30
3       9.49
4       1.45
        ...
3014   -5.80
3015   -2.86
3016   -0.59
3017   -3.43
3018   -6.79
Name: High, Length: 3019, dtype: float64

## DataFrame

### 7. Creating Dataframe

In [88]:
# keys become column names
details = pd.DataFrame({'name': ['Vinay', 'Kushal', 'Aman', 'Saif','Khajur', 'Gulati'], 
                   'age': [22, 25, 24, 28,12,43], 
                    'occupation': ['engineer', 'doctor', 'data analyst', 'teacher','student','manager']})
details

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
4  Khajur   12       student
5  Gulati   43       manager

### 8. Accessing elements in dataframe

#### Accessing by rows

In [89]:
details[['name']]

     name
0   Vinay
1  Kushal
2    Aman
3    Saif
4  Khajur
5  Gulati

In [90]:
# Column names
details.columns

Index(['name', 'age', 'occupation'], dtype='object')

In [91]:
details

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
4  Khajur   12       student
5  Gulati   43       manager

In [92]:
details[0:2]

     name  age occupation
0   Vinay   22   engineer
1  Kushal   25     doctor

In [93]:
# Selecting alternate rows starting from index = 5
details[1::2].head()

     name  age occupation
1  Kushal   25     doctor
3    Saif   28    teacher
5  Gulati   43    manager

#### Accessing by columns

In [94]:
Age = details[details['age'] >23] 
Age

     name  age    occupation
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
5  Gulati   43       manager

In [95]:
Name = details[details['name'] =='Kushal']
Name

     name  age occupation
1  Kushal   25     doctor

In [96]:
print(type(details['age']))
print(type(details[['age']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

#### Inserting elements in dataframe

In [97]:
df_row_insert =  details.append({'name':'Shyam',
                        'age':22,
                        'occupation':'S.E'}, ignore_index = True)
df_row_insert

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
4  Khajur   12       student
5  Gulati   43       manager
6   Shyam   22           S.E

In [98]:
df_row_insert.insert(3, "Phone", [9840534832,983746521,9765342323,9934212323,7409873121,9876542323,9876544343])

In [99]:
details_phone=df_row_insert
details_phone

     name  age    occupation       Phone
0   Vinay   22      engineer  9840534832
1  Kushal   25        doctor   983746521
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323
6   Shyam   22           S.E  9876544343

### 9. Deleting an element in a dataframe

In [100]:
#deleting elements in a row
details_phone.drop([1])

     name  age    occupation       Phone
0   Vinay   22      engineer  9840534832
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323
6   Shyam   22           S.E  9876544343

In [101]:
details_phone

     name  age    occupation       Phone
0   Vinay   22      engineer  9840534832
1  Kushal   25        doctor   983746521
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323
6   Shyam   22           S.E  9876544343

In [102]:
# deleting columns
details_phone.drop('Phone', axis = 1)

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
4  Khajur   12       student
5  Gulati   43       manager
6   Shyam   22           S.E

In [103]:
index_drop = details_phone.drop(details_phone.index[[2,4]])
index_drop

     name  age occupation       Phone
0   Vinay   22   engineer  9840534832
1  Kushal   25     doctor   983746521
3    Saif   28    teacher  9934212323
5  Gulati   43    manager  9876542323
6   Shyam   22        S.E  9876544343

In [104]:
df_valuedrop = details_phone[details_phone.name != 'Shyam']

In [105]:
df_valuedrop

     name  age    occupation       Phone
0   Vinay   22      engineer  9840534832
1  Kushal   25        doctor   983746521
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323

### 10. Rename columns

In [106]:
details_phone = details_phone.rename(columns={"name": "Name", "age": "Age", "occupation": "Occupation"})
details_phone

     Name  Age    Occupation       Phone
0   Vinay   22      engineer  9840534832
1  Kushal   25        doctor   983746521
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323
6   Shyam   22           S.E  9876544343

### 11. Change index of a dataframe

In [107]:
details_phone

     Name  Age    Occupation       Phone
0   Vinay   22      engineer  9840534832
1  Kushal   25        doctor   983746521
2    Aman   24  data analyst  9765342323
3    Saif   28       teacher  9934212323
4  Khajur   12       student  7409873121
5  Gulati   43       manager  9876542323
6   Shyam   22           S.E  9876544343

In [108]:
details_phone.set_index('Name')

        Age    Occupation       Phone
Name
Vinay    22      engineer  9840534832
Kushal   25        doctor   983746521
Aman     24  data analyst  9765342323
Saif     28       teacher  9934212323
Khajur   12       student  7409873121
Gulati   43       manager  9876542323
Shyam    22           S.E  9876544343

### 12. Load from csv

In [109]:
Marks = pd.read_csv("Marks.csv")
Marks

      Name  Science  Maths  English  Social
0    Arnav       88    NaN     76.0    87.0
1    Manek       77   87.0      NaN    88.0
2     Ajay       67   88.0     88.0     NaN
3    Arjun       94   87.0     45.0    98.0
4  Gurmeet       88   45.0      NaN    87.0

In [110]:
#DataFrame as series
Specific_column = pd.read_csv("Marks.csv", usecols = ['English'],  squeeze = True)
Specific_column

0    76.0
1     NaN
2    88.0
3    45.0
4     NaN
Name: English, dtype: float64

### 13. Dealing with NaN

In [111]:
Marks.isnull()

    Name  Science  Maths  English  Social
0  False    False   True    False   False
1  False    False  False     True   False
2  False    False  False    False    True
3  False    False  False    False   False
4  False    False  False     True   False

In [112]:
Marks

      Name  Science  Maths  English  Social
0    Arnav       88    NaN     76.0    87.0
1    Manek       77   87.0      NaN    88.0
2     Ajay       67   88.0     88.0     NaN
3    Arjun       94   87.0     45.0    98.0
4  Gurmeet       88   45.0      NaN    87.0

In [113]:
Marks1 = Marks.fillna(method = 'ffill', axis = 1)
Marks1

      Name Science Maths English Social
0    Arnav      88    88      76     87
1    Manek      77    87      87     88
2     Ajay      67    88      88     88
3    Arjun      94    87      45     98
4  Gurmeet      88    45      45     87

In [114]:
Marks2 = Marks[['Name','Science','Maths']].fillna(method = 'ffill', limit=1, axis = 1)
Marks2

      Name Science Maths
0    Arnav      88    88
1    Manek      77    87
2     Ajay      67    88
3    Arjun      94    87
4  Gurmeet      88    45

In [115]:
Marks3 = Marks[['English','Social']].fillna(method = 'bfill', limit=1, axis = 1)
Marks3

   English  Social
0     76.0    87.0
1     88.0    88.0
2     88.0     NaN
3     45.0    98.0
4     87.0    87.0

In [116]:
Marks3.dropna(axis = 0)

   English  Social
0     76.0    87.0
1     88.0    88.0
3     45.0    98.0
4     87.0    87.0

In [117]:
Marks.interpolate()

      Name  Science  Maths  English  Social
0    Arnav       88    NaN     76.0    87.0
1    Manek       77   87.0     82.0    88.0
2     Ajay       67   88.0     88.0    93.0
3    Arjun       94   87.0     45.0    98.0
4  Gurmeet       88   45.0     45.0    87.0

### 14. Join Dataframes

In [118]:
Dataframe_join = Marks2.join(Marks3)
Dataframe_join

      Name Science Maths  English  Social
0    Arnav      88    88     76.0    87.0
1    Manek      77    87     88.0    88.0
2     Ajay      67    88     88.0     NaN
3    Arjun      94    87     45.0    98.0
4  Gurmeet      88    45     87.0    87.0

In [119]:
Marks2 = Marks2.drop([2])
Marks2

      Name Science Maths
0    Arnav      88    88
1    Manek      77    87
3    Arjun      94    87
4  Gurmeet      88    45

In [120]:
Dataframe_join = Marks2.join(Marks3)
Dataframe_join

      Name Science Maths  English  Social
0    Arnav      88    88     76.0    87.0
1    Manek      77    87     88.0    88.0
3    Arjun      94    87     45.0    98.0
4  Gurmeet      88    45     87.0    87.0

In [121]:
details1 = pd.DataFrame({'name': ['Vijay', 'Kunal', 'Amar', 'Sai','Kartik', 'Gupta'], 
                   'age': [22, 25, 24, 28,12,43], 
                    'occupation': ['engineer', 'enginner', 'data analyst', 'teacher','engineer','engineer']})
details1

     name  age    occupation
0   Vijay   22      engineer
1   Kunal   25      enginner
2    Amar   24  data analyst
3     Sai   28       teacher
4  Kartik   12      engineer
5   Gupta   43      engineer

In [122]:
details

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher
4  Khajur   12       student
5  Gulati   43       manager

In [123]:
Data = pd.concat([details, details1], axis = 0, ignore_index = True)
Data

      name  age    occupation
0    Vinay   22      engineer
1   Kushal   25        doctor
2     Aman   24  data analyst
3     Saif   28       teacher
4   Khajur   12       student
5   Gulati   43       manager
6    Vijay   22      engineer
7    Kunal   25      enginner
8     Amar   24  data analyst
9      Sai   28       teacher
10  Kartik   12      engineer
11   Gupta   43      engineer

### 15. Row wise and column wise operation

In [124]:
Data.groupby(['age']).agg(list)

                 name                    occupation
age
12   [Khajur, Kartik]           [student, engineer]
22     [Vinay, Vijay]          [engineer, engineer]
24       [Aman, Amar]  [data analyst, data analyst]
25    [Kushal, Kunal]            [doctor, enginner]
28        [Saif, Sai]            [teacher, teacher]
43    [Gulati, Gupta]           [manager, engineer]

In [125]:
Data.sort_values(['name']).agg(list)

      name  age    occupation
2     Aman   24  data analyst
8     Amar   24  data analyst
5   Gulati   43       manager
11   Gupta   43      engineer
10  Kartik   12      engineer
4   Khajur   12       student
7    Kunal   25      enginner
1   Kushal   25        doctor
9      Sai   28       teacher
3     Saif   28       teacher
6    Vijay   22      engineer
0    Vinay   22      engineer

In [126]:
Data.sort_values(['name'], ascending = False).agg(list)

      name  age    occupation
0    Vinay   22      engineer
6    Vijay   22      engineer
3     Saif   28       teacher
9      Sai   28       teacher
1   Kushal   25        doctor
7    Kunal   25      enginner
4   Khajur   12       student
10  Kartik   12      engineer
11   Gupta   43      engineer
5   Gulati   43       manager
8     Amar   24  data analyst
2     Aman   24  data analyst

In [127]:
df = pd.DataFrame(data = [[4, 9], [5, 6], [7, 5]], columns=['A', 'B'])
df

   A  B
0  4  9
1  5  6
2  7  5

In [128]:
# Using a reducing function
sum_df = df.apply(np.sum, axis=0)
sum_df

A    16
B    20
dtype: int64

In [129]:
sum_col_df = df.apply(np.sum, axis=1)
sum_col_df

0    13
1    11
2    12
dtype: int64

In [130]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [131]:
df.apply(lambda x: [1, 2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [132]:
df.apply(lambda x: [1, 2], axis=1, result_type='reduce')

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [133]:
df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [134]:
df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

In [135]:
df

   A  B
0  4  9
1  5  6
2  7  5

In [136]:
df.sum()

A    16
B    20
dtype: int64

In [137]:
df.diff()

     A    B
0  NaN  NaN
1  1.0 -3.0
2  2.0 -1.0

In [138]:
print(df.count())
print(df['A'].count())

A    3
B    3
dtype: int64
3

In [139]:
df.mean()

A    5.333333
B    6.666667
dtype: float64

In [140]:
df.median()

A    5.0
B    6.0
dtype: float64

In [141]:
df.mode()

   A  B
0  4  5
1  5  6
2  7  9

In [142]:
df.max()

A    7
B    9
dtype: int64

In [143]:
df.min()

A    4
B    5
dtype: int64

In [144]:
print(df.describe())

              A         B
count  3.000000  3.000000
mean   5.333333  6.666667
std    1.527525  2.081666
min    4.000000  5.000000
25%    4.500000  5.500000
50%    5.000000  6.000000
75%    6.000000  7.500000
max    7.000000  9.000000

In [145]:
print(df.shape)
print(df.ndim)
print(df.size)

(3, 2)
2
6